[
{
    "id": 1,
    "zodiac": "Gemini (May 21 - June 20): You are most compatible with other air signs and fire signs. They understand why you are the way you that you are."

},

{
    "id": 2,
    "zodiac": "Taurus(April 20 - May 20): You are most compatible with other earth signs, Capricorn and Virgo, make a great match for Taurus, as they share the same fundamental nature. "
},

{
    "id": 3,
    "zodiac": "Aries (March 21 - April 29): Sagittarius are gonna be great companion because they are outgoing and adventerous. Gemini as well. "
},

{
    "id": 4,
    "zodiac": "Cancer (June 21 - July 22): Scorpio and Pisces, two very intuitive and emotional signs, will deeply appreciate Cancer’s love and dedication."
},

{
    "id": 5,
    "zodiac": "Leo (July 23–August 22): Sagittarius, Aquarius, and Gemini share Leo’s aspirations and excitement, making them very suitable matches."
},

{
    "id": 6,
    "zodiac": "Virgo (August 23–September 22): Capricorn shares Virgo’s love for hard work and setting goals. Taurus and Scorpio are passionate and trusted potential partners."
},

{
    "id": 7,
    "zodiac": "Libra (September 23–October 22):Because Libra is so measured, partnering with another Libra is probably the most logical choice. People of this zodiac sign can also do well with an Aries or an Aquarius, who provide an intriguing challenge and mental stimulation."
},

{
    "id": 8,
    "zodiac": "Scorpio (October 23–November 21):The other two water signs, Pisces and Cancer, also experience the world primarily through their emotions and can match the intensity of Scorpio. These signs are willing to forge the powerful bonds that Scorpio secretly craves.     "
},

{
    "id": 9,
    "zodiac": "Sagittarius (November 22–December 21): Another Sagittarius or a Gemini would definitely be able to vibe with that type of inquisitive and energetic lifestyle. Aries, another sign that loves to be active, may also be able to provide a firm, guiding hand where one is needed."
},

{
    "id": 10,
    "zodiac": "Capricorn (December 22–January 19): Virgos and other Capricorns appreciate and respect the drive this sign has, and they sympathize with the desire to be perfect. Scorpios know that there is more to this sign than meets the eye, as they are often misunderstood themselves."
},

{
    "id": 11,
    "zodiac": "Aquarius (January 20–February 18):Aquarius will be best off with its own kind or with a Gemini, who is similarly energetic and nimble-minded. Libra, a proponent of fairness and lover of research, also lives up to the humanitarian inclinations of an Aquarius.    "
},

{
    "id": 12,
    "zodiac": "Pisces (February 19–March 20): Scorpio and Cancer are like Pisces in that they are deeply invested in emotional connections. Scorpio has a special fondness for this sign’s ability to think and to live abstractly, which fits Ridout’s assessment that Pisces needs"
}

]